[{"id":"0\r","title":"Batman Timeline\r","author":"No author given but it's probably me","content":"\r\nI love reading DC stories and if you're like me, then you enjoy reading comics in the context of other comics. Unfortunalty, DC can't keep a continuity alive even if their life depended on it. I however, have decided to try and sort comic book events into one chronoligical timeline and post it for others to view. Now, if you know anything about DC, then you know there are thousands of characters in their stories and since I would like to **NOT** have brain damage by the end of this project, I've decided to focus on one character for my sake and yours. That character is... Batman.\r\n\r\nUse the timeline to navigate through different stories. Each cover will include a summary of what and include any of my own thoughts and reviews."},{"id":"1\r","title":"Year One  \r","author":"No author given but it's probably me","content":"\r\n*Year One* tells the origins of Bruce Wayne as Batman. Well, one of them at least but more on the second one later. The story begins with Bruce Wayne returning to Gotham after years of training in secret. Photographers and Journalists surround him, promising to keep the public updated on his activities in Gotham. In another part of town, Jim Gordon arrives in Gotham by train, saddened by the view out the window and with good reason. Gordon quickly learns how corrupt the Gotham Police Department is first-hand. His partner, Detective Flass, along with some other cops end up beating him as a warning for refusing to bend the rules.\r\n\r\nWhile Gordon gets a little too accustomed to his new life in Gotham (he cheats on his wife with a detective named Essen), Bruce returns to the East End. Bruce meets Holly, an underage prostitute and after seeing her boss, beats him up for how he treats her. Once the fight breaks out, Holly ends up stabbing Bruce in the leg with Selina Kyle, later to be Catwoman, fighting him long enough for the cops to arrive and arrest Bruce. Before they can recognize him as a million dollar playboy, he breaks out of the handcuffs and causes the car to crash. Before running away, he drags the officers to safety. At the mansion, Bruce holds off on calling Alfred for help with his injuries and instead, recalls the night of his parent's death. The night where he swore vengeance on crime. Suddenly, a bat comes crashing through the window and Bruce takes this as a sign, saying the famous line:\r\n\r\n\"Yes father, I shall become a bat\"\r\n\r\nAs Gordon becomes the press's favorite cop, Bruce begins building crime-fighting experience by taking down simple street muggers. Eventually however, he graduates to taking down corruption at its root. Interrupting Gotham's elite, he warns them that their reign is over and that from now on, no one is safe. Now that Batman has targeted wealthy criminal elites, GCPD will go to any lengths to catch him with Gordon taking the lead of the task force. In one occasion, Gordon tries to save an old lady from an out of control car but ends up being saved by Batman who runs away shortly after to not get caught. Batman rushes into an old building to escape but cant make it out in time before GCPD sends a helicopter to blow the building up. After the explosion, a SWAT team is sent into the building to make sure Batman is dead. Batman uses the debris to his advantage, taking down the men and ends up escaping by using an ultrasonic gadget that attracts bats to create a theatrical diversion.\r\n\r\nBatman gets a young drug dealer, Skeevers, to throw Detective Flass under the bus and as soon as Gordon hears about this, he informs Internal Affairs about Flass. As a warning for messing with his business,  Commissioner Loeb threatens to tell Gorodn's wife, Barabara, about his affair. Gordon decides it's best if she heard it from him first so after checking on Bruce Wayne, who pretends to be nothing more than a million dollar playboy, he tells her everything. Eventually however, they have a baby boy.\r\n\r\nOne night, Gordon gets called into work by the commissioner but in reality, it's just an excuse to get him out of the house so a hitman can kill Gordon's family for revenge on Flass. The hitman gets a hold of the baby and drives away with Gordon pursuing him while a mysterious figure chases after the men as well. Gordon causes the car to crash on a bridge and the two men end up in a close combat situation where the hitman throws the baby over the railing. That mysterious person from before ends up diving off the bridge and catches the baby just in time. Unknown to Gordon, it was Bruce who saved his boy and left before the cops could make it to the scene.\r\n\r\nIn the aftermath, Flass testifies against Commissioner Loeb, leading to him considering resignation. Gotham still thrives with corruption but the final panels show Gordon’s hope for the city. Finally, he mentions a new criminal going by the name “The Joker” as well as a “new friend” who’s willing to help him out and well, we all know how that turns out.\r\n"},{"id":"2\r","title":"Batman Year Zero\r","author":"No author given but it's probably me","content":"Stop I aks;djlksajhdol I still have no idea what I'm doing"}]